#ifndef FUNCA_H  // Захист від повторного включення заголовкового файлу
#define FUNCA_H

#include <complex> // Підключаємо бібліотеку для роботи з комплексними числами

// Оголошення класу FuncA
class FuncA {
    public:
        FuncA();  // Конструктор класу
        virtual ~FuncA() {}  // Віртуальний деструктор для коректного очищення при успадкуванні

        std::complex<double> Calculate(int m, std::complex<double> x); // Метод для обчислення значення
};

#endif // Завершуємо умовну компіляцію для цього заголовкового файлу

