#!/bin/bash

# URL балансувальника навантаження
URL="http://10.0.2.15/compute"

# Функція для надсилання HTTP-запитів
send_request() {
    while true; do
        echo "Надсилається запит до $URL..."
        curl -s "$URL" > /dev/null
        echo "Запит до $URL успішно відправлено."
        sleep 5  # Очікування 5 секунд перед наступним запитом
    done
}

# Запуск кількох асинхронних запитів
for i in {1..10}; do
    sleep 2
    send_request &  # Запуск кожного запиту в окремому процесі
done

wait  # Очікуємо завершення всіх процесів

